{"cells":[{"cell_type":"markdown","metadata":{"id":"uI9_k-R1psOP"},"source":["# 12.2 Часть 2\n"]},{"cell_type":"markdown","metadata":{"id":"kEUGknC1pvZr"},"source":["https://stepik.org/lesson/327221/step/1?unit=310520"]},{"cell_type":"markdown","metadata":{"id":"OvArz3AEpxHV"},"source":["**Список четных**\n","\n","На вход программе подается четное число n , n ≥ 2. Напишите программу, которая выводит список четных чисел\n","\n","      [2, 4, 6, ..., n]\n","\n","Формат входных данных\n","- На вход программе подается четное натуральное число.\n","\n","Формат выходных данных\n","- Программа должна вывести текст в соответствии с условием задачи."]},{"cell_type":"code","execution_count":9,"metadata":{"colab":{"base_uri":"https://localhost:8080/"},"executionInfo":{"elapsed":1576,"status":"ok","timestamp":1657633717684,"user":{"displayName":"Aleksandr Karmanov","userId":"15294286742571504241"},"user_tz":-180},"id":"vXTl62Z3pkpG","outputId":"91f482d4-6e76-479b-940f-1c407a77d49b"},"outputs":[{"name":"stdout","output_type":"stream","text":["8\n","[2, 4, 6, 8]\n"]}],"source":["n = int(input())\n","res = [x for x in range(2, n + 1, 2)]\n","print(res)"]},{"cell_type":"markdown","metadata":{"id":"_M1uLHjTq7P8"},"source":["**Сумма двух списков**\n","\n","На вход программе подаются две строки текста, содержащие целые числа. Из данных строк формируются списки чисел L и M. Напишите программу, которая создает третий список, элементами которого являются суммы соответствующих элементов списков L и M. Далее программа должна вывести каждый элемент полученного списка на одной строке через 1 пробел.\n","\n","Формат входных данных\n","- На вход программе подаются две строки текста, содержащие целые числа, разделенные символом пробела.\n","\n","Формат выходных данных\n","- Программа должна вывести текст в соответствии с условием задачи.\n","\n","Примечание. Количество чисел в обеих строках одинаковое."]},{"cell_type":"code","execution_count":10,"metadata":{"colab":{"base_uri":"https://localhost:8080/"},"executionInfo":{"elapsed":10864,"status":"ok","timestamp":1657633950748,"user":{"displayName":"Aleksandr Karmanov","userId":"15294286742571504241"},"user_tz":-180},"id":"CBQHMvytq_Qw","outputId":"581a9790-a9ba-418a-b6e0-9b1730b67b4f"},"outputs":[{"name":"stdout","output_type":"stream","text":["3 1 4\n","1 5 9\n","4 6 13\n"]}],"source":["L = list(map(int, input().split()))\n","M = list(map(int, input().split()))\n","res = []\n","\n","for i in range(len(L)):\n","    res.append(L[i] + M[i])\n","print(*res)"]},{"cell_type":"markdown","metadata":{"id":"c9NyPIaLrxr5"},"source":["**Сумма чисел**\n","\n","На вход программе подается строка текста, содержащая натуральные числа. Напишите программу, которая вставляет между каждым числом знак +, а затем вычисляет сумму полученных чисел.\n","\n","Формат входных данных\n","- На вход программе подается строка текста, содержащая натуральные числа, разделенные символом пробела.\n","\n","Формат выходных данных\n","- Программа должна вывести текст в соответствии с условием задачи.\n","\n","Примечание. Строковый метод join() работает только со списком строк."]},{"cell_type":"code","execution_count":22,"metadata":{"colab":{"base_uri":"https://localhost:8080/"},"executionInfo":{"elapsed":1752,"status":"ok","timestamp":1657634584889,"user":{"displayName":"Aleksandr Karmanov","userId":"15294286742571504241"},"user_tz":-180},"id":"n4w1t5Ner0AA","outputId":"5edfeacd-7ff9-46e6-d6ce-54ef7c00f1e0"},"outputs":[{"name":"stdout","output_type":"stream","text":["2 5 11 33 55\n","2+5+11+33+55=106\n"]}],"source":["lst = list(map(int, input().split()))\n","\n","print(*lst, sep='+', end='=')\n","print(sum(lst))"]},{"cell_type":"markdown","metadata":{"id":"lTbW_HAluPZM"},"source":["**Валидный номер 🌶️🌶️**\n","\n","На вход программе подается строка текста. Напишите программу, которая определяет является ли введенная строка корректным телефонным номером. Строка текста является корректным телефонным номером если она имеет формат:\n","\n","abc-def-hijk или\n","\n","7-abc-def-hijk\n","\n","где a, b, c, d, e, f, h, i, j, k – цифры от 0 до 9.\n","\n","Формат входных данных \n","- На вход программе подается строка текста.\n","\n","Формат выходных данных\n","- Программа должна вывести «YES» если строка является корректным телефонным номером и «NO» в противном случае.\n","\n","Примечание. Телефонный номер должен содержать только цифры и символ -, а количество цифр в каждой группе должны быть правильным."]},{"cell_type":"code","execution_count":61,"metadata":{"colab":{"base_uri":"https://localhost:8080/"},"executionInfo":{"elapsed":2340,"status":"ok","timestamp":1657638828612,"user":{"displayName":"Aleksandr Karmanov","userId":"15294286742571504241"},"user_tz":-180},"id":"oZi_mAKkuYeX","outputId":"2de41af3-55d6-4302-af11-da67ee5a4c70"},"outputs":[{"name":"stdout","output_type":"stream","text":["7-301-447-5820\n","YES\n"]}],"source":["lst = input().split('-')\n","if ''.join(lst).isdigit():\n","    if lst[0] == '7':\n","        del lst[0]\n","    if len(lst[0]) == 3 and len(lst[1]) == 3 and len(lst[2]) == 4:\n","        print('YES')\n","    else:\n","        print('NO')    \n","else:\n","    print('NO')\n"]},{"cell_type":"markdown","metadata":{"id":"1J_ydahp-ena"},"source":["**Самый длинный**\n","\n","На вход программе подается строка текста. Напишите программу, использующую списочное выражение, которая находит длину самого длинного слова.\n","\n","Формат входных данных\n","- На вход программе подается строка текста.\n","\n","Формат выходных данных\n","- Программа должна вывести текст в соответствии с условием задачи."]},{"cell_type":"code","execution_count":62,"metadata":{"colab":{"base_uri":"https://localhost:8080/"},"executionInfo":{"elapsed":5054,"status":"ok","timestamp":1657639157080,"user":{"displayName":"Aleksandr Karmanov","userId":"15294286742571504241"},"user_tz":-180},"id":"EngDoiOx-iBP","outputId":"e2efd303-2e00-4bd4-f9ed-038347de85c2"},"outputs":[{"name":"stdout","output_type":"stream","text":["проспал почти всю ночь\n","7\n"]}],"source":["s = input().split()\n","lst = [len(x) for x in s]\n","print(max(lst))"]},{"cell_type":"markdown","metadata":{"id":"nl_SFAff_u5o"},"source":["**Молодежный жаргон**\n","\n","На вход программе подается строка текста. Напишите программу, использующую списочное выражение, которая преобразует каждое слово введенного текста в \"молодежный жаргон\" по следующему правилу: \n","\n","1. первая буква каждого слова удаляется и ставится в конец слова; \n","2. затем в конец слова добавляется слог \"ки\".\n","\n","Формат входных данных\n","- На вход программе подается строка текста на русском языке.\n","\n","Формат выходных данных\n","- Программа должна вывести текст в соответствии с условием задачи."]},{"cell_type":"code","execution_count":64,"metadata":{"colab":{"base_uri":"https://localhost:8080/"},"executionInfo":{"elapsed":1424,"status":"ok","timestamp":1657639346278,"user":{"displayName":"Aleksandr Karmanov","userId":"15294286742571504241"},"user_tz":-180},"id":"bAaObDLL_zvm","outputId":"f59473ed-b24d-4069-89df-7cc32759b7e1"},"outputs":[{"name":"stdout","output_type":"stream","text":["проспал почти всю ночь\n","роспалпки очтипки сювки очьнки\n"]}],"source":["s = input().split()\n","res = [x[1:] + x[0] + 'ки' for x in s]\n","print(*res)"]}],"metadata":{"colab":{"authorship_tag":"ABX9TyO7RgsF4xl4zD/CowGY5A4W","name":"4. Итоговая работа на списки.ipynb","provenance":[]},"kernelspec":{"display_name":"Python 3","name":"python3"},"language_info":{"name":"python"}},"nbformat":4,"nbformat_minor":0}
