{"nbformat":4,"nbformat_minor":0,"metadata":{"colab":{"name":"Модуль8. Модули и пакеты. Работа с файлами.ipynb","provenance":[],"collapsed_sections":["qV4LB2YAlmfP"],"authorship_tag":"ABX9TyP60/UU+otRNW7Pn4yXJb8P"},"kernelspec":{"name":"python3","display_name":"Python 3"},"language_info":{"name":"python"}},"cells":[{"cell_type":"markdown","source":["#8.1 Импорт стандартных модулей. Команды import и from\n","https://stepik.org/lesson/567064/step/1?unit=561338"],"metadata":{"id":"qV4LB2YAlmfP"}},{"cell_type":"markdown","source":["Подвиг 2. На вход программы подается вещественное число. Необходимо импортировать модуль math, вызывать функцию ceil этого модуля для введенного числа и отобразить результат на экране.\n","\n"],"metadata":{"id":"X92lebfwl1wW"}},{"cell_type":"code","execution_count":null,"metadata":{"colab":{"base_uri":"https://localhost:8080/"},"id":"eyemNbAPlXGk","executionInfo":{"status":"ok","timestamp":1651878121218,"user_tz":-180,"elapsed":2247,"user":{"displayName":"Aleksandr Karmanov","userId":"15294286742571504241"}},"outputId":"224d51fb-47c4-4141-e6a1-7b9b32b509f2"},"outputs":[{"output_type":"stream","name":"stdout","text":["2.2\n","3\n"]}],"source":["import math\n","\n","a = float(input())\n","print(math.ceil(a))"]},{"cell_type":"markdown","source":["Подвиг 3. На вход программы подается вещественное число. Необходимо импортировать только одну функцию floor из модуля math, вызывать ее для введенного числа и отобразить результат на экране.\n","\n"],"metadata":{"id":"ocxcVP4gmJL6"}},{"cell_type":"code","source":["from math import floor\n","\n","a = float(input())\n","print(floor(a))"],"metadata":{"colab":{"base_uri":"https://localhost:8080/"},"id":"36IBUs9qmJy4","executionInfo":{"status":"ok","timestamp":1651877983425,"user_tz":-180,"elapsed":3818,"user":{"displayName":"Aleksandr Karmanov","userId":"15294286742571504241"}},"outputId":"bd93a799-c049-43ec-c0cf-01226287fda4"},"execution_count":null,"outputs":[{"output_type":"stream","name":"stdout","text":["2.2\n","2\n"]}]},{"cell_type":"markdown","source":["Подвиг 4. В программе имеется функция factorial (см. листинг). В начале программы (до определения функции) необходимо из модуля math импортировать функцию с тем же именем factorial, используя команду from, но так, чтобы они не \"затирали\" друг друга.\n","\n","Уже объявленную функцию не менять. Выполнять функции не нужно, только прописать импорт."],"metadata":{"id":"QeGnZK1emgGF"}},{"cell_type":"code","source":["from math import factorial as fc\n","\n","def factorial(n):\n","    p = 1\n","    for i in range(2, n+1):\n","        p *= i\n","\n","    print(\"my factorial\")\n","    return p\n","\n","print(fc(5))\n","print(factorial(5))    "],"metadata":{"colab":{"base_uri":"https://localhost:8080/"},"id":"-S5vcDi2mggW","executionInfo":{"status":"ok","timestamp":1651878143742,"user_tz":-180,"elapsed":249,"user":{"displayName":"Aleksandr Karmanov","userId":"15294286742571504241"}},"outputId":"a9e3b4ff-f38b-4220-cc97-d55b94c51a8d"},"execution_count":null,"outputs":[{"output_type":"stream","name":"stdout","text":["120\n","my factorial\n","120\n"]}]},{"cell_type":"markdown","source":["Подвиг 5. Из модуля random импортируйте только две функции: seed и randint. Затем, в программе выполните их, следующим образом:\n","\n","    seed(1)\n","    print(randint(10, 50))"],"metadata":{"id":"lic10RQknJJm"}},{"cell_type":"code","source":["from random import randint, seed\n","\n","seed(1)\n","print(randint(10, 50))"],"metadata":{"colab":{"base_uri":"https://localhost:8080/"},"id":"Qyqb-_cJnKoB","executionInfo":{"status":"ok","timestamp":1651878237183,"user_tz":-180,"elapsed":389,"user":{"displayName":"Aleksandr Karmanov","userId":"15294286742571504241"}},"outputId":"d7993e44-62d9-429a-dbf0-a75f3bc38d58"},"execution_count":null,"outputs":[{"output_type":"stream","name":"stdout","text":["18\n"]}]},{"cell_type":"markdown","source":["Подвиг 6. Из модуля random импортируйте только две функции: seed и random, но у последней должен быть синоним rnd (имя, через которое она будет вызываться в программе). Выполните в программе эти функции, следующим образом:\n","\n","    seed(10)\n","    print(round(rnd(), 2))"],"metadata":{"id":"lmBdPdkZnejm"}},{"cell_type":"code","source":["from random import seed, random as rnd\n","\n","seed(10)\n","print(round(rnd(), 2))"],"metadata":{"colab":{"base_uri":"https://localhost:8080/"},"id":"7EOZOP1unf3J","executionInfo":{"status":"ok","timestamp":1651878416283,"user_tz":-180,"elapsed":249,"user":{"displayName":"Aleksandr Karmanov","userId":"15294286742571504241"}},"outputId":"79cfe91a-f18e-4dc3-844e-23cf31550bd1"},"execution_count":null,"outputs":[{"output_type":"stream","name":"stdout","text":["0.57\n"]}]},{"cell_type":"markdown","source":["#8.2 Импорт собственных модулей\n","https://stepik.org/lesson/567065/step/1?unit=561339"],"metadata":{"id":"0pCX18ZYoxcE"}},{"cell_type":"markdown","source":["#8.3 Установка сторонних модулей. Пакетная установка\n","https://stepik.org/lesson/567066/step/1?unit=561340"],"metadata":{"id":"OQREr4_To2l9"}},{"cell_type":"markdown","source":["#8.4 Пакеты (package) в Python\n","https://stepik.org/lesson/567067/step/1?unit=561341"],"metadata":{"id":"NjAjLV_nj2bq"}},{"cell_type":"markdown","source":["#8.5 Функция open. Чтение данных из файла\n","https://stepik.org/lesson/567068/step/1?unit=561342"],"metadata":{"id":"KmQ_at35kGdx"}},{"cell_type":"markdown","source":["#8.6 Обработка исключения FileNotFoundError и менеджер контекста\n","https://stepik.org/lesson/567069/step/1?unit=561343"],"metadata":{"id":"sh-wGMSQSuRB"}},{"cell_type":"markdown","source":["Подвиг 2. Имеется фрагмент программы (см. листинг ниже). При его выполнении возникает ошибка FileNotFoundError. Запишите конструкцию try / except, чтобы отображалось сообщение \"File Not Found\", если файл не удается открыть.\n","\n"],"metadata":{"id":"IwGmI2_qVv_x"}},{"cell_type":"code","source":["try:\n","    f = open(\"abc.txt\")\n","    r = f.read(1)\n","    f.close()\n","except FileNotFoundError:\n","    print('File Not Found')"],"metadata":{"colab":{"base_uri":"https://localhost:8080/"},"id":"wyke586cSxRc","executionInfo":{"status":"ok","timestamp":1651957651790,"user_tz":-180,"elapsed":401,"user":{"displayName":"Aleksandr Karmanov","userId":"15294286742571504241"}},"outputId":"c76a9022-3c55-43aa-e512-26d77da6e8a3"},"execution_count":2,"outputs":[{"output_type":"stream","name":"stdout","text":["File Not Found\n"]}]},{"cell_type":"markdown","source":["#8.7 Запись данных в файл\n","https://stepik.org/lesson/567070/step/1?unit=561344\n"],"metadata":{"id":"dEu_MkVeW834"}}]}